# Task 3
# Via List
season = ['зима', 'весна', 'лето', 'осень']
n = int(input('Введите целое число от 1 до 12 - '))
while n < 1 or n > 12:
    print('Нужно целое число от 1 до 12!')
    n = int(input('Введите целое число от 1 до 12 - '))

print(season[0]) if n <= 2 or n == 12 else print(season[1]) if 3 <= n <= 5 else print(
    season[2]) if 6 <= n <= 8 else print(season[3])

# via dict

season = {1: 'зима', 2: 'зима', 3: 'весна', 4: 'весна', 5: 'весна', 6: 'лето', 7: 'лето', 8: 'лето', 9: 'осень',
          10: 'осень', 11: 'осень', 12: 'зима'}
n = int(input('Давайте попробуем еще раз. Введите целое число от 1 до 12 - '))
while n < 1 or n > 12:
    print('Нужно целое число от 1 до 12!')
    n = int(input('Введите целое число от 1 до 12 - '))
print(season.get(n))